In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [20,50,70]
n1 = np.array(my_data)
d = {'a':20,'b':50,'c':70}

In [4]:
labels

['a', 'b', 'c']

In [5]:
my_data

[20, 50, 70]

In [6]:
d

{'a': 20, 'b': 50, 'c': 70}

In [7]:
pd.Series(data = my_data)

0    20
1    50
2    70
dtype: int64

In [8]:
pd.Series(data=my_data,index=labels)

a    20
b    50
c    70
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    20
b    50
c    70
dtype: int64

In [10]:
dex = ['s','m','d']
data_dex = [100,50,25]
pertamina = np.array(data_dex)
d = {'s':100,'m':50,'d':25}
pd.Series(data_dex,dex)

s    100
m     50
d     25
dtype: int64

In [11]:
pd.Series(d)

s    100
m     50
d     25
dtype: int64

In [12]:
d

{'s': 100, 'm': 50, 'd': 25}

In [13]:
pd.Series(data_dex)

0    100
1     50
2     25
dtype: int64

In [14]:
pd.Series(data_dex,dex)

s    100
m     50
d     25
dtype: int64

In [15]:
pd.Series(data = dex)

0    s
1    m
2    d
dtype: object

In [16]:
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
ser1 = pd.Series([1,2,3,4],['indonesia','malaysia','thailand','vietman'])

In [18]:
ser1

indonesia    1
malaysia     2
thailand     3
vietman      4
dtype: int64

In [19]:
ser2 = pd.Series([1,3,4,5],['indonesia','china','vietnam','russia'])

In [20]:
ser2

indonesia    1
china        3
vietnam      4
russia       5
dtype: int64

In [21]:
ser3 =pd.Series(data=labels)

In [22]:
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser2['china']

3

In [24]:
## Data Frame - Part 2

In [100]:
import numpy as np
import pandas as pd

In [101]:
from numpy.random import randn

In [102]:
np.random.seed(101)

In [103]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [104]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [105]:
booldf = df > 0

In [106]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [109]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
resultdf = df[df['W']>0]

In [111]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [112]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [113]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [116]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
## Selection And Indexing

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [66]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [68]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [70]:
type (df['W'])

pandas.core.series.Series

In [71]:
df['new'] = df['W'] + df['Z']

In [72]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [73]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [75]:
df.drop('new',axis=1,inplace=True)

In [86]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [87]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [89]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [90]:
df.loc['A','Y']

0.9079694464765431

In [91]:
df.iloc[2,3]

-0.5890005332865824

In [92]:
## More Indeks Detail

In [94]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [117]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [119]:
newindx = 'CA BA AD OR AW'.split()

In [121]:
newindx

['CA', 'BA', 'AD', 'OR', 'AW']

In [122]:
df['States'] = newindx

In [123]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     BA
C -2.018168  0.740122  0.528813 -0.589001     AD
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     AW

In [126]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
BA      0.651118 -0.319318 -0.848077  0.605965
AD     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
AW      0.190794  1.978757  2.605967  0.683509

In [130]:
df.set_index('States',inplace=True)